#include <iostream>      // Підключення бібліоткеки для виконання завд.
#include <Windows.h>	// Підключення програмного інтерфейсу Win32 API для роботи з конфігурацією консолі Windows
using namespace std;        // Вказ. використання простору імен std (зменшення коду)


int main() {        // Створ. головної функції програми (точки входа)
	SetConsoleCP(1251);		// Встановлення кодової сторінки Windows-1251 для введення тексту (введення тексту з клавіатури в консоль)
	SetConsoleOutputCP(1251);		// Встановлення кодової сторінки Windows-1251 для потоку виведення (відображення кирилиці та українських букв на екрані)
	
    /* Завдання 1 (Begin 27)*/
    short velo1 = 1;
	short velo2 = 2;    // Створ. змінні типу short(для оптимізацї), щонесуть знач. швидкості      
	float time, s1, s2;        // Створ. змін. типу float(для оптимізації),несуть знач. відстані.

	cout << "Введіть час руху в годинах: ";  // Виведення на екран повідомлення"
	cin >> time;		// Введення знач. часу руху
	
	cout << "Введіть початкову відстань в км: ";  // Виведення на екран повідомлення"
	cin >> s1;		// Введення знач. початкової відстані

	cout << " час руху: " << time << endl;
	cout << " початковa відстань: " << s1 << endl;
	
	s2 = s1 + time * (velo1 + velo2); // Обчислення відстані, яку пройде тіло за час time
	cout << "Відстань , яку пройде тіло за " << time << "годин(години) дорівнює ---> " << s2;  // Виведення на екран повідомлення"
	
    
    
    /* Завдання 2 */
	double A, x, y;     // Оголошення змінних A, x, y типу double 
    cout << "Введіть число A: ";        // Виведення повідомлення на екран
    cin >> A;       // Зчитування значення змінної A з консолі

    x = A * A;       // обчислення A²
    cout << "A^2 = " << x << endl;      // Виведення результату A² на екран

    y = x * A;       // обчислення A³
    cout << "A^3 = " << y << endl;      // Виведення результату A³ на екран

    x = y * x;       // обчислення A⁵
    cout << "A^5 = " << x << endl;      // Виведення результату A⁵ на екран

    y = x * x;       // обчислення A¹⁰
    cout << "A^10 = " << y << endl;     // Виведення результату A¹⁰ на екран

    x = y * x;       // обчислення A¹⁵
    cout << "A^15 = " << x << endl;     // Виведення результату A¹⁵ на екран

	
    
    /* Завдання 3 */

	double a, b, H;     // Оголошення змінних a, b, H типу double
    cout << "Введіть значення a: ";     // Виведення повідомлення для користувача
    cin >> a;
    cout << "Введіть значення b: ";     // Виведення повідомлення для користувача
    cin >> b;
    H = 2 * a * b / (a + b);        // Обчислення середнього гармонійного значення a і b
    cout << "Середнє гармонійне a і b: " << H;      // Виведення результату обчислення середнього гармонійного значення a і b

    return 0;        // Повернення 0 програми,її успішне завершення
}
