#include <iostream>      // Підключення бібліоткеки для виконання завд.
#include <Windows.h>	// Підключення програмного інтерфейсу Win32 API для роботи з конфігурацією консолі Windows
using namespace std;        // Вказ. використання простору імен std (зменшення коду)


int main() {        // Створ. головної функції програми (точки входа)
    SetConsoleCP(1251);		// Встановлення кодової сторінки Windows-1251 для введення тексту (введення тексту з клавіатури в консоль)
    SetConsoleOutputCP(1251);		// Встановлення кодової сторінки Windows-1251 для потоку виведення (відображення кирилиці та українських букв на екрані)

    /* ---------- Завдання 1 (Begin 27) ---------- */
    cout << "Завдання Begin 27: " << endl;

    // Створ. змін. типу float(для оптимізації),знач. відстані, швидк, часу
    float time, s1, s2, velo1, velo2;

    // Блок вводу даних
    cout << "Введіть швидкість першого тіла в км/год: ";        // Повідомлення для користувача
    cin >> velo1;                                               // Введення значення змінної
    cout << "Введіть швидкість другого тіла в км/год: ";
    cin >> velo2;
    cout << "Введіть час руху в годинах: ";
    cin >> time;
    cout << "Введіть початкову відстань в км: ";  
    cin >> s1;		
    
    // Блок виведення на екран введених даних (для перевірки)
    cout << "V1 = " << velo1 << " км/год" << endl;
    cout << "V2 = " << velo2 << " км/год" << endl;
    cout << "t = " << time << " годин(и)" << endl;
    cout << "Початкова S = " << s1 << " км" << endl;

    // Блок обчислення
    s2 = s1 + time * (velo1 + velo2); // Обчислення відстані, яку пройде тіло за час time
    cout << "Відстань , яку пройде тіло за " << time << " годин(и) дорівнює ---> " << s2 << " км" << endl;  // Виведення на екран повідомлення"
    cout << "" << endl;


    /* ---------- Завдання 2 (Begin 19) ---------- */
    cout << "Завдання Begin 19: " << endl;
    double A, x, y;     // Оголошення змінних A, x, y типу double 
    cout << "Введіть число A: ";        // Виведення повідомлення на екран
    cin >> A;       // Зчитування значення змінної A з консолі

    x = A * A;       // обчислення A²
    cout << "A^2 = " << x << endl;      // Виведення результату A² на екран

    y = x * A;       // обчислення A³
    cout << "A^3 = " << y << endl;      // Виведення результату A³ на екран

    x = y * x;       // обчислення A⁵
    cout << "A^5 = " << x << endl;      // Виведення результату A⁵ на екран

    y = x * x;       // обчислення A¹⁰
    cout << "A^10 = " << y << endl;     // Виведення результату A¹⁰ на екран

    x = y * x;       // обчислення A¹⁵
    cout << "A^15 = " << x << endl;     // Виведення результату A¹⁵ на екран
    cout << "" << endl;


    /* ---------- Завдання 3 (Begin 37) ---------- */
    cout << "Завдання Begin 37: " << endl;
    
    // Оголошення змінних a, b, H типу double
    double a, b, H;     
    
    // Блок введення даних
    cout << "Введіть значення a: ";     // Виведення повідомлення для користувача
    cin >> a;                           // Введення значення змінної
    cout << "Введіть значення b: ";     
    cin >> b;
    
    // Блок обчислення
    H = 2 * a * b / (a + b);        
    cout << "Середнє гармонійне a і b: " << H;      // Виведення результату обчислення середнього гармонійного значення a і b
    cout << "" << endl;

    return 0;        // Повернення 0 програми,її успішне завершення
